EDT/МПСтриж/src/InformationRegisters/ТранзакцииAssist/ТранзакцииAssist.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТранзакцииAssist</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>billnumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаТранзакции</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>merchant_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.Экспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.ТипыОперацийAssist</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/МПСтриж/src/Catalogs/ИнтернетМагазины/ИнтернетМагазины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнтернетМагазины</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАгрегатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЛатиницей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиAssistПоТерминалам</name>
    <attributes>
      <name>РегионДоставки</name>
      <type>
        <types>CatalogRef.РегиональныеТерминалы</types>
      </type>
    </attributes>
    <attributes>
      <name>MerchantId</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>login</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>password</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/МПСтриж/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженоВСервисе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчетСБП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>assist_merchantId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>assist_login</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>assist_password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиAssistПоТерминалам</name>
    <attributes>
      <name>РегионДоставки</name>
      <type>
        <types>CatalogRef.РегиональныеТерминалы</types>
      </type>
    </attributes>
    <attributes>
      <name>MerchantId</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>login</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>password</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/МПСтриж/src/CommonModules/ИнтеграцияAssistСервер/Module.bsl
Функция ЗафиксироватьДанныеВРСAssist(ДанныеКФиксации) Экспорт
	ТекПериод = ТекущаяДата();
	
	Наб = РегистрыСведений.ТранзакцииAssist.СоздатьНаборЗаписей();
	Наб.Отбор.Период.Установить(ТекПериод);
	Наб.Отбор.Заказ.Установить(ДанныеКФиксации.Заказ);
	
	НовЗапись = Наб.Добавить();
	
	ЗаполнитьЗначенияСвойств(НовЗапись, ДанныеКФиксации);
	
	НовЗапись.Период = ТекПериод;
	
	Наб.Записать(Ложь);
	
	Возврат Истина;
КонецФункции	

Функция ПреобразованиеДатыAssist(СтрокаДатыAssist) Экспорт	
	СтрокаДаты = Сред(СтрокаДатыAssist, 7, 4) + 
		Сред(СтрокаДатыAssist, 4, 2) +
		Лев(СтрокаДатыAssist, 2) +
		Сред(СтрокаДатыAssist, 12, 2) +
		Сред(СтрокаДатыAssist, 15, 2) +
		Прав(СтрокаДатыAssist, 2);
		
		
	Возврат Дата(СтрокаДаты);
КонецФункции	

Функция ПолучитьДанныеAssistПоОрганизации(Организация, ИнтернетМагазин = Неопределено) Экспорт
	Если ИнтернетМагазин <> Неопределено Тогда
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		|	ИнтернетМагазиныНастройкиAssistПоТерминалам.MerchantId КАК MerchantId,
		|	ИнтернетМагазиныНастройкиAssistПоТерминалам.login КАК login,
		|	ИнтернетМагазиныНастройкиAssistПоТерминалам.password КАК password
		|ИЗ
		|	Справочник.ИнтернетМагазины.НастройкиAssistПоТерминалам КАК ИнтернетМагазиныНастройкиAssistПоТерминалам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ТекущийРегион КАК ТекущийРегион
		|		ПО ИнтернетМагазиныНастройкиAssistПоТерминалам.РегионДоставки.Ссылка = ТекущийРегион.Значение.Ссылка
		|ГДЕ
		|	ИнтернетМагазиныНастройкиAssistПоТерминалам.Ссылка = &ИнтернетМагазин";
		
		Зап.УстановитьПараметр("ИнтернетМагазин", ИнтернетМагазин);
		Рез = Зап.Выполнить().Выбрать();
		
		Если Не Рез.Следующий() Тогда
			//Возврат Неопределено;
		Иначе
			Струк = Новый Структура;
			Струк.Вставить("MerchantId", Рез.MerchantId); 
			Струк.Вставить("login", Рез.login);  
			Струк.Вставить("password", Рез.password);
			Возврат Струк;
		КонецеСли;	
	КонецЕсли;
	
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	|	ОрганизацииНастройкиAssistПоТерминалам.MerchantId КАК MerchantId,
	|	ОрганизацииНастройкиAssistПоТерминалам.login КАК login,
	|	ОрганизацииНастройкиAssistПоТерминалам.password КАК password
	|ИЗ
	|	Справочник.Организации.НастройкиAssistПоТерминалам КАК ОрганизацииНастройкиAssistПоТерминалам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ТекущийРегион КАК ТекущийРегион
	|		ПО ОрганизацииНастройкиAssistПоТерминалам.РегионДоставки.Ссылка = ТекущийРегион.Значение.Ссылка
	|ГДЕ
	|	ОрганизацииНастройкиAssistПоТерминалам.Ссылка = &Организация";
	
	Зап.УстановитьПараметр("Организация", Организация);
	
	Рез = Зап.Выполнить().Выбрать();
	
	Если Не Рез.Следующий() Тогда
		Возврат Неопределено;
	Иначе
		Струк = Новый Структура;
		Струк.Вставить("MerchantId", Рез.MerchantId); 
		Струк.Вставить("login", Рез.login);  
		Струк.Вставить("password", Рез.password);
		Возврат Струк;
	КонецеСли;	
КонецФункции
